#+TITLE: Bash_powershell

#+BEGIN_SRC bash
echo "Many hands make light work." | base64
#+END_SRC

#+RESULTS:
: TWFueSBoYW5kcyBtYWtlIGxpZ2h0IHdvcmsuCg==
  TWFueSBoYW5kcyBtYWtlIGxpZ2h0IHdvcmsu

#+BEGIN_SRC bash
echo "Hola a todos!!" | base64 # | base64 -d
#+END_SRC

#+RESULTS:
: Hola a todos!!

#+BEGIN_SRC bash
base64 fcfm.png > fcfm_logo_encoded.b64

#+END_SRC

#+RESULTS:


#+BEGIN_SRC bash
base64 -d fcfm_logo_encoded.b64 > fcfm_logo_decoded.png

#+END_SRC

#+RESULTS:
